In [1]:
# Section 7: Correlated SubQueries And Common Table Expression (CTEs)
'''
 * This section focuses on Correlated Subqueries and Common Table Expressions (CTEs).
 * A Correlated Subquery refers to a column in a table from the outer query. A correlated subquery is executed multiple times for each 
 record of the outer query, whereas a non-correlated subquery is executed only once.
 * A Common Table Expression can be used to simplify complex queries and provide an alternative means to query hierarchical 
 data using recursive CTEs.
'''

In [13]:
# Recap on SubQueries
'''
select * from emp;
-- find the employee which is always running the above of average salary
select * from emp where sal > ( select avg(sal) from emp);


-- inline view fo subquery in from clause
select ename , sal from (select * from emp where ename = 'KING')

--
select * from emp where empno IN (select empno from emp where deptno = 10);
'''

"\nselect * from emp;\n-- find the employee which is always running the above of average salary\nselect * from emp where sal > ( select avg(sal) from emp);\n\n\n-- inline view fo subquery in from clause\nselect ename , sal from (select * from emp where ename = 'KING')\n\n--\nselect * from emp where empno IN (select empno from emp where deptno = 10);\n"

In [17]:
# Correlated SubQueries , Where Exists And Where Not Exists
'''
select * from eba_countries;

select a.* 
from eba_countries a 
WHERE a.INTERMEDIATE_REGION_ID = (
    select b.id from eba_country_intermediates b where a.INTERMEDIATE_REGION_ID = b.id
) ;

'''
# Where EXISTS 
'''
select a.* 
from eba_countries a 
WHERE exists (
    select b.id from eba_country_intermediates b where a.INTERMEDIATE_REGION_ID = b.id
) ;


select a.* 
from eba_countries a 
WHERE not exists (
    select b.id from eba_country_intermediates b where a.INTERMEDIATE_REGION_ID = b.id
) ;

select a.* 
from eba_countries a 
WHERE exists (
    select 1 from eba_country_intermediates b where 1 = 1
) ;


select a.* 
from eba_countries a 
WHERE exists (
    select 1 from eba_country_intermediates b where 1 = 2
) ;
'''

'\nselect a.* \nfrom eba_countries a \nWHERE exists (\n    select b.id from eba_country_intermediates b where a.INTERMEDIATE_REGION_ID = b.id\n) ;\n\n\nselect a.* \nfrom eba_countries a \nWHERE not exists (\n    select b.id from eba_country_intermediates b where a.INTERMEDIATE_REGION_ID = b.id\n) ;\n\nselect a.* \nfrom eba_countries a \nWHERE exists (\n    select 1 from eba_country_intermediates b where 1 = 1\n) ;\n\n\nselect a.* \nfrom eba_countries a \nWHERE exists (\n    select 1 from eba_country_intermediates b where 1 = 2\n) ;\n'

In [19]:
# Commont Table Expression (CTEs)
'''
with cte_emp ( ename, empno, sal, deptno )
AS
(
    select ename, empno , sal , deptno from emp where sal > 2000
)
select * from cte_emp;
'''
# 
'''
with cte_emp ( ename, empno, sal, deptno )
AS
(
    select ename, empno , sal , deptno from emp where sal > 2000
),
cte_dept (deptno)
AS (
    select deptno from dept where deptno in (10,20)
)

select 
 a.*
from cte_emp a 
join cte_dept b 
on a.deptno = b.deptno;
'''

'\nwith cte_emp ( ename, empno, sal, deptno )\nAS\n(\n    select ename, empno , sal , deptno from emp where sal > 2000\n),\ncte_dept (deptno)\nAS (\n    select deptno from dept where deptno in (10,20)\n)\n\nselect \n a.*\nfrom cte_emp a \njoin cte_dept b \non a.deptno = b.deptno;\n'

In [21]:
# Recursive CTEs
'''
create table scalar_table(n int);
insert into scalar_table values(1);
select * from scalar_table;

with cte_5 (n)
AS 
(
    select n from scalar_table
    union all 
    select n+1 from cte_5 where n<5 -- ORA-32044: cycle detected while executing recursive WITH query
)
select * from cte_5;
'''
# 
'''
select ename, ename,mgr from emp 
start with ename in ('BLAKE','CLARK')
connect by prior empno = mgr;


with cte_emp (empno, ename, mgr) 
AS 
(
    select empno , ename, mgr from EMP where ename in ('BLAKE','CLARK')
    union all 
    select emp.empno, emp.ename, emp.mgr from cte_emp join emp on cte_emp.empno = emp.mgr
)
select * from cte_emp;
'''

#### 
'''
with cte_emp (empno, ename, mgr, n) 
AS 
(
    select empno , ename, mgr,1 from EMP where mgr is null --Anchir QUery
    union all 
    select emp.empno, emp.ename, emp.mgr,n+1 from cte_emp join emp on cte_emp.empno = emp.mgr
)
select * from cte_emp;
'''

'\nwith cte_emp (empno, ename, mgr, n) \nAS \n(\n    select empno , ename, mgr,1 from EMP where mgr is null --Anchir QUery\n    union all \n    select emp.empno, emp.ename, emp.mgr,n+1 from cte_emp join emp on cte_emp.empno = emp.mgr\n)\nselect * from cte_emp;\n'

In [6]:
# Assignment Question 1

In [7]:
# Assignment Question 2

In [8]:
# Assignment Question 3